{
	"drag-ruler": {
		"dependencies": {
			"ok": "OK",
			"terrain-ruler": {
				"title": "Comment mesurer un terrain difficile avec Drag Ruler",
				"text": "Vous avez le module {moduleName} activé. Drag Ruler est capable de mesurer un terrain difficile qui a été placé à l'aide de ce module. Pour rendre cela possible, Drag Ruler utilise le module Terrain Ruler. Si Terrain Ruler est installé et activé Drag Ruler commencera automatiquement à respecter le terrain difficile dans ses mesures.",
				"neverShowAgain": "Ne plus jamais afficher cela"
			},
			"socketlib": {
				"title": "Module Socketlib manquant",
                                "text": "Drag Ruler nécessite que le module socketlib fonctionne correctement. Veuillez activer le module socketlib dans ce monde."
			}
		},
		"resetMovementHistory": "Réinitialiser l'historique des mouvements",
		"genericSpeedProvider": {
			"settings": {
				"dashMultiplier": {
					"name": "Multiplicateur de courses",
					"hint": "Cela peut être utilisé pour donner aux jetons une vitesse secondaire pendant la coloration du chemin mesuré. Réglez-le sur 0 pour désactiver la vitesse secondaire."
				},
				"speedAttribute": {
                                        "name": "Attribut de vitesse",
                                        "hint": "L'attribut qui définit la vitesse de marche d'un jeton. Il est utilisé lors de la coloration du chemin mesuré." 				}
			},
			"speeds": {
				"walk": "marche",
				"dash": "course"
			}
		},
		"settings": {
			"alwaysShowSpeedForPCs": {
				"name": "Afficher la vitesse du PJ à tout le monde",
				"hint": "Si activé, la coloration basée sur la vitesse de l'acteur pour les personnages joueurs sera montrée à tout le monde, même s'ils n'ont pas la permission d'observateur pour la feuille de personnage."
			},
			"autoStartMeasurement": {
				"name": "Démarrer automatiquement la mesure",
				"hint": "Si activé, Drag Ruler commencera à mesurer dès que le jeton est glissé. S'il est désactivé, Drag Ruler restera inactif et ne commencera à mesurer qu'une fois que le bouton pour ajouter un waypoint est enfoncé."
			},
			"enableMovementHistory": {
				"name": "Activer l'historique des mouvements pendant le combat",
				"hint": "Si activé, Drag Ruler se souviendra du chemin emprunté par un jeton pendant son tour de combat et l'affichera lorsque vous récupérerez le jeton."
			},
			"showGMRulerToPlayers": {
				"name": "Afficher la règle MJ aux joueurs",
				"hint": "Si désactivé, la règle des MJ ne sera pas affichée pour les joueurs non-MJ"
			},
			"speedProviderSettings": {
				"name": "Paramètres du système de vitesse",
				"hint": "Les paramètres du système de vitesse contiennent tous les paramètres spécifiques au système de jeu.",
				"button": "Paramètres du système de vitesse",
				"windowTitle": "Paramètres du système de vitesse",
				"headers": {
					"speedProvider": "système de vitesse",
					"speedProviderSettings": "Paramètres spécifiques au système de vitesse"
				},
				"activeProvider": {
					"name": "système de vitesse actuellement actif",
					"hint": "Les paramètres indiqués ci-dessous dépendent du système de vitesse actif. Si le MJ sélectionne un système de vitesse différent, les paramètres disponibles peuvent changer."
				},
				"noSettings": "Ce système de vitesse n'offre aucune option de configuration.",
				"color": {
					"name": "Couleur pour {colorName}",
					"hint": "La couleur qui sera utilisée pour colorier les carrés qui sont dans la plage {colorName}",
					"unreachable": {
						"name": "injoignable",
						"hint": "La couleur des espaces qui ne sont pas accessibles par le jeton déplacé"
					}
				},
				"speedProvider": {
					"name": "système de paramètres de vitesse",
					"indice": "Sélectionnez qui fournit les informations de vitesse pour les jetons lors de la coloration. Drag Ruler offre un système de vitesse générique qui fournit des fonctionnalités de base et devrait fonctionner pour tous les systèmes de jeu s'il est correctement configuré. Plus de systèmes de vitesse peuvent être mis à disposition via les systèmes de jeu et les modules installés . La sélection d'un autre système de vitesse que le système de vitesse générique peut offrir une meilleure intégration dans les règles du système de jeu que vous utilisez. Les options ci-dessous dépendent du système de vitesse sélectionné ici.",
					"choices": {
						"module": "Module {name}",
						"native": "Générique",
						"system": "Systéme {name}"
					}
				}
			},
			"useGridlessRaster": {
				"name": "Use speed based snapping",
				"hint": "On Gridless scenes, this makes tokens snap to the token's speed ranges. This can be temporarily disabled by pressing Shift during drag."
			}
		}
	}
}
